tutorials/coupled/conjugateHeatFoam/conjugateCavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     conjugateHeatFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  off;

maxCo           0.5;

functions
(
    heatFlux
    {
        // Type of functionObject
        type heatFlux;
        outputControl timeStep;
        outputInterval 1;

        K              kappaEff;
    }

    heatFlux
    {
        // Type of functionObject
        type heatFlux;
        outputControl timeStep;
        outputInterval 1;
        region solid;

        K              k;
    }
);

// ************************************************************************* //
